[
  {
    "player_name": "Saber",
    "user_id": "40484842",
    "game_id": "20251231_043310",
    "total": 710,
    "turns_survived": 31,
    "eras_visited": 1,
    "belonging_score": 100,
    "legacy_score": 100,
    "freedom_score": 0,
    "ending_type": "balanced",
    "final_era": "Viking Age Scandinavia",
    "timestamp": "2025-12-31T16:17:31.592220",
    "blurb": "Found balance in Viking Age Scandinavia"
  },
  {
    "player_name": "ab",
    "total": 535,
    "turns_survived": 11,
    "eras_visited": 1,
    "belonging_score": 100,
    "legacy_score": 100,
    "freedom_score": 25,
    "ending_type": "balanced",
    "final_era": "Classical Athens - The Golden Age",
    "timestamp": "2025-12-25T01:41:00.798385",
    "blurb": "Found balance in Classical Athens - The Golden Age",
    "ending_narrative": "[You choose to stay forever]\nYou feel the device's warmth fade against your wrist as the decision crystallizes in your heart. The pulsing slows, dims, and finally dies—not with mechanical failure, but with the quiet finality of a door closing on one path so another may be walked fully. When you roll up your sleeve later that night, the display shows nothing but dark metal. The window has closed forever, and you are no longer a traveler between worlds but simply a man who has chosen his home.\n\nThe years that follow prove your choice wise beyond measure. Kleander's corruption scheme crumbles when you expose his network to authorities across Greece, strengthening your reputation as an incorruptible neutral arbiter. Your emporion becomes legendary—the Sacred Grove of Hermes where honest trade flourishes even as the Peloponnesian War tears the Greek world apart. Students come from as far as Sicily to study in your school, where they learn not just rhetoric and mathematics, but the radical idea that enemies can meet in peace. Aristomenes becomes more than a partner; he's the brother you chose, standing beside you through plague years and bitter winters, celebrating when former students return as ambassadors and philosophers. You never marry—some whisper it's because you loved a woman from a distant land—but you mentor dozens of young people who call you father in all but blood. Your Swiss Army knife becomes the stuff of legend among metalworkers, studied and copied though never equaled.\n\nAs decades pass and your hair turns white, the emporion evolves into something beyond your original vision. It's not just a trading post but a cultural bridge, where Persian scholars debate with Athenian philosophers, where Spartan warriors lay down arms to study poetry, where the first seeds of cosmopolitan Greek culture take root. You live to see Alexander march past your borders, carrying ideas that first flowered in your neutral ground to the edges of the known world. Former students become the diplomats who shape the Hellenistic age, carrying forward the principle that enemies need not remain enemies forever.\n\nOn your final morning, sitting in the shrine you built to a god of travelers, you feel no regret for the journey not taken. The time machine lies buried beneath the altar's foundation—you interred it there decades ago, knowing its purpose was complete. Around you, grandchildren of your first students play in gardens planted by Persian and Athenian hands alike. You built something that outlasted empires: proof that a stranger can become family, that neutrality is not indifference but love made practical, that home is not where you begin but where you choose to belong. The Far-Seer found his farthest shore in the place he finally chose to stay."
  },
  {
    "player_name": "duner",
    "user_id": "40484842",
    "game_id": "20260101_104530",
    "total": 440,
    "turns_survived": 8,
    "eras_visited": 1,
    "belonging_score": 81,
    "legacy_score": 76,
    "freedom_score": 3,
    "ending_type": "balanced",
    "final_era": "World War II - American Home Front",
    "timestamp": "2026-01-01T10:59:07.335936",
    "blurb": "Found balance in World War II - American Home Front",
    "ending_narrative": "You set down your pen and place your hand over the pulsing device. The warmth spreads through your palm one final time as you whisper, \"This is home.\" The display flickers, showing temporal coordinates that fade to nothing. The pulsing slows, stutters, then stops forever. The device grows cold against your skin - just an unusual watch now, its purpose spent. Margaret looks up from her wedding invitations, smiling at your peaceful expression, never knowing she just won a battle against time itself.\n\nThe wedding in June 1945 becomes the talk of the plant. Colonel Harrison gives a speech about how \"Sam's strategic mind helped win the war,\" while Frank weeps openly at giving away the hobo who became family. You and Margaret buy the little house on Elm Street, the one with the victory garden she tended during the war years. Your children grow up hearing carefully edited stories about Daddy's \"remarkable intuition\" during the war, never knowing their father once walked through time. You channel your future knowledge carefully - subtle innovations at the aircraft plant that becomes a peacetime manufacturing company, quiet investments that secure your family's prosperity, small acts that make the world slightly better.\n\nMargaret never stops marveling at your uncanny ability to anticipate trends, to suggest the right solution at the perfect moment. Together you build something lasting - not just a family, but a legacy of lives saved and communities strengthened. The letters from grateful soldiers become a wall of remembrance in your study. You teach your daughter engineering and your son the value of protecting others, watching them carry forward the compassion that defined your impossible journey.\n\nIn 1987, at seventy-three, you die peacefully in the same house where you chose to stay. Margaret holds your hand as you fade, the time machine device a cold weight on your wrist that she's never questioned. Your granddaughter finds it while settling the estate - just an old broken watch to her, tossed into a donation box without a second thought. But the life you built endures: children who became teachers and doctors, a company that treated workers fairly, a community strengthened by one man's choice to love this time more than the promise of infinite others.\n\n<anchors>belonging[+0] legacy[+0] freedom[+0]</anchors>\nENDING_TYPE: balanced"
  },
  {
    "player_name": "ab",
    "total": 115,
    "turns_survived": 2,
    "eras_visited": 1,
    "belonging_score": 15,
    "legacy_score": 5,
    "freedom_score": 0,
    "ending_type": "abandoned",
    "final_era": "Viking Age Scandinavia",
    "timestamp": "2025-12-24T22:53:51.627884",
    "blurb": "Quit in Viking Age Scandinavia"
  },
  {
    "player_name": "Saber",
    "user_id": "40484842",
    "game_id": "20251231_162712",
    "total": 90,
    "turns_survived": 1,
    "eras_visited": 1,
    "belonging_score": 5,
    "legacy_score": 0,
    "freedom_score": 0,
    "ending_type": "abandoned",
    "final_era": "American Civil War",
    "timestamp": "2025-12-31T16:28:49.441441",
    "blurb": "Quit in American Civil War",
    "ending_narrative": ""
  },
  {
    "player_name": "Ab",
    "user_id": "40484842",
    "game_id": "20251231_022551",
    "total": 85,
    "turns_survived": 1,
    "eras_visited": 1,
    "belonging_score": 0,
    "legacy_score": 0,
    "freedom_score": 0,
    "ending_type": "abandoned",
    "final_era": "Classical Athens - The Golden Age",
    "timestamp": "2025-12-31T02:27:00.891153",
    "blurb": "Quit in Classical Athens - The Golden Age"
  },
  {
    "player_name": "Saber",
    "user_id": "40484842",
    "game_id": "20251231_154014",
    "total": 75,
    "turns_survived": 0,
    "eras_visited": 1,
    "belonging_score": 0,
    "legacy_score": 0,
    "freedom_score": 0,
    "ending_type": "abandoned",
    "final_era": "Classical Athens - The Golden Age",
    "timestamp": "2025-12-31T15:41:07.047453",
    "blurb": "Quit in Classical Athens - The Golden Age"
  }
]